In [315]:
import pandas as pd
import numpy as np

In [316]:
df = pd.read_csv("Train.csv")
test = pd.read_csv("Test.csv")

In [317]:
dataset = [df,test]

In [318]:
df.head()

,id,realtionship_status,industry,genre,targeted_sex,average_runtime(minutes_per_week),airtime,airlocation,ratings,expensive,money_back_guarantee,netgain
0,19717,Married-spouse-absent,Auto,Comedy,Male,45,Primetime,United-States,0.027465,High,No,False
1,31593,Married-civ-spouse,Pharma,Comedy,Male,45,Primetime,United-States,0.027465,Low,No,False
2,5681,Divorced,Entertainment,Comedy,Female,45,Primetime,United-States,0.027465,High,Yes,False
3,15491,Separated,Political,Infomercial,Female,40,Primetime,United-States,0.027465,Low,No,False
4,23587,Married-civ-spouse,Pharma,Comedy,Male,48,Primetime,United-States,0.027465,High,No,True

In [319]:
test.head()

,id,realtionship_status,industry,genre,targeted_sex,average_runtime(minutes_per_week),airtime,airlocation,ratings,expensive,money_back_guarantee
0,1,Widowed,Auto,Comedy,Female,10,Daytime,United-States,0.027465,Low,No
1,4,Married-civ-spouse,Pharma,Comedy,Male,40,Morning,United-States,0.056262,High,Yes
2,5,Divorced,Entertainment,Comedy,Female,50,Morning,United-States,0.027465,Low,No
3,9,Married-civ-spouse,Pharma,Infomercial,Male,40,Primetime,United-States,0.027465,Low,No
4,10,Married-civ-spouse,Pharma,Comedy,Male,40,Primetime,United-States,0.027465,Low,Yes

In [320]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26048 entries, 0 to 26047
Data columns (total 12 columns):
id                                   26048 non-null int64
realtionship_status                  26048 non-null object
industry                             26048 non-null object
genre                                26048 non-null object
targeted_sex                         26048 non-null object
average_runtime(minutes_per_week)    26048 non-null int64
airtime                              26048 non-null object
airlocation                          26048 non-null object
ratings                              26048 non-null float64
expensive                            26048 non-null object
money_back_guarantee                 26048 non-null object
netgain                              26048 non-null bool
dtypes: bool(1), float64(1), int64(2), object(8)
memory usage: 2.2+ MB

In [321]:
df.industry.value_counts()

Pharma           10339
Auto              6801
Political         4014
Entertainment     2765
Other             1333
ClassAction        796
Name: industry, dtype: int64

In [322]:
df.genre.value_counts()

Comedy         22258
Infomercial     2516
Drama            803
Direct           247
Other            224
Name: genre, dtype: int64

In [323]:
df.expensive.value_counts()

Low       15693
High       7279
Medium     3076
Name: expensive, dtype: int64

In [324]:
for x in dataset:
    x['industry'] = x['industry'].map({"Pharma":5,"Auto":4,"Political":3,"Entertainment":2,"Other":1,"ClassAction":0})
    x['genre'] = x['genre'].map({"Comedy":4,"Infomercial":3,"Drama":2,"Direct":1,"Other":0})
    x['targeted_sex']=x['targeted_sex'].map({"Male":1,"Female":0})
    x['airtime']=x.airtime.map({"Primetime":2,"Morning":1,"Daytime":0})
    x['expensive']=x.expensive.map({"High":2,"Medium":1,"Low":0})
    x['money_back_guarantee']=x.money_back_guarantee.map({"Yes":1,"No":0})
    x['realtionship_status']=x.realtionship_status.map({"Married-civ-spouse":6,"Never-married":5,"Divorced":4,"Widowed":3,"Separated":2,"Married-spouse-absent":1,"Married-AF-spouse":0})

In [325]:
df['ratings']=(df['ratings']*100000).astype(int)

,id,realtionship_status,industry,genre,targeted_sex,average_runtime(minutes_per_week),airtime,airlocation,ratings,expensive,money_back_guarantee
0,1,3,4,4,0,10,0,38,2746,0,0
1,4,6,5,4,1,40,1,38,5626,2,1
2,5,4,2,4,0,50,1,38,2746,0,0
3,9,6,5,3,1,40,2,38,2746,0,0
4,10,6,5,4,1,40,2,38,2746,0,1

In [326]:
test.head()

,id,realtionship_status,industry,genre,targeted_sex,average_runtime(minutes_per_week),airtime,airlocation,ratings,expensive,money_back_guarantee
0,1,3,4,4,0,10,0,United-States,0.027465,0,0
1,4,6,5,4,1,40,1,United-States,0.056262,2,1
2,5,4,2,4,0,50,1,United-States,0.027465,0,0
3,9,6,5,3,1,40,2,United-States,0.027465,0,0
4,10,6,5,4,1,40,2,United-States,0.027465,0,1

In [327]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
for x in dataset:
    x['airlocation'] = le.fit_transform(x['airlocation'])

In [328]:
df.head()

,id,realtionship_status,industry,genre,targeted_sex,average_runtime(minutes_per_week),airtime,airlocation,ratings,expensive,money_back_guarantee,netgain
0,19717,1,4,4,1,45,2,39,2746,2,0,False
1,31593,6,5,4,1,45,2,39,2746,0,0,False
2,5681,4,2,4,0,45,2,39,2746,2,1,False
3,15491,2,3,3,0,40,2,39,2746,0,0,False
4,23587,6,5,4,1,48,2,39,2746,2,0,True

In [329]:
# def gain(x):
#     if x=="True":
#         return 1
#     if x=="False":
#         return 0

In [330]:
# df['netgain_e'] = df['netgain'].apply(gain)

In [331]:
df['netgain'] = le.fit_transform(df.netgain)

In [332]:
df.realtionship_status.value_counts()

6    11844
5     8547
4     3649
3      818
2      793
1      378
0       19
Name: realtionship_status, dtype: int64

In [333]:
df.head()

,id,realtionship_status,industry,genre,targeted_sex,average_runtime(minutes_per_week),airtime,airlocation,ratings,expensive,money_back_guarantee,netgain
0,19717,1,4,4,1,45,2,39,2746,2,0,0
1,31593,6,5,4,1,45,2,39,2746,0,0,0
2,5681,4,2,4,0,45,2,39,2746,2,1,0
3,15491,2,3,3,0,40,2,39,2746,0,0,0
4,23587,6,5,4,1,48,2,39,2746,2,0,1

In [334]:
y = df['netgain'].values

In [335]:
x = df.drop(['netgain'],axis=1).values

In [336]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2)

In [337]:
from sklearn.ensemble import RandomForestClassifier
clf=RandomForestClassifier(n_estimators=100)
clf.fit(x_train,y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=None, max_features='auto', max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=100,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [338]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26048 entries, 0 to 26047
Data columns (total 12 columns):
id                                   26048 non-null int64
realtionship_status                  26048 non-null int64
industry                             26048 non-null int64
genre                                26048 non-null int64
targeted_sex                         26048 non-null int64
average_runtime(minutes_per_week)    26048 non-null int64
airtime                              26048 non-null int64
airlocation                          26048 non-null int64
ratings                              26048 non-null int64
expensive                            26048 non-null int64
money_back_guarantee                 26048 non-null int64
netgain                              26048 non-null int64
dtypes: int64(12)
memory usage: 2.4 MB

In [339]:
df.expensive.isna().sum()

0

In [340]:
y_pred = clf.predict(x_test)

In [341]:
y_test

array([0, 1, 0, ..., 0, 1, 0])

In [342]:
y_pred

array([0, 0, 0, ..., 0, 1, 0])

In [343]:
from sklearn import metrics

In [344]:
print("Accuracy:",metrics.accuracy_score(y_test, y_pred))

Accuracy: 0.7869481765834933

In [345]:
test.head()

,id,realtionship_status,industry,genre,targeted_sex,average_runtime(minutes_per_week),airtime,airlocation,ratings,expensive,money_back_guarantee
0,1,3,4,4,0,10,0,38,0.027465,0,0
1,4,6,5,4,1,40,1,38,0.056262,2,1
2,5,4,2,4,0,50,1,38,0.027465,0,0
3,9,6,5,3,1,40,2,38,0.027465,0,0
4,10,6,5,4,1,40,2,38,0.027465,0,1

In [346]:
test['ratings']=(test['ratings']*100000).astype(int)

In [347]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6513 entries, 0 to 6512
Data columns (total 11 columns):
id                                   6513 non-null int64
realtionship_status                  6513 non-null int64
industry                             6513 non-null int64
genre                                6513 non-null int64
targeted_sex                         6513 non-null int64
average_runtime(minutes_per_week)    6513 non-null int64
airtime                              6513 non-null int64
airlocation                          6513 non-null int64
ratings                              6513 non-null int64
expensive                            6513 non-null int64
money_back_guarantee                 6513 non-null int64
dtypes: int64(11)
memory usage: 559.8 KB

In [348]:
    x = test.values

In [349]:
Y_pred = clf.predict(x)

In [350]:
dft = test['id']

In [351]:
dft = pd.DataFrame(dft)

In [354]:
dft['netgain'] = Y_pred

In [355]:
dft.head(10)

   id  netgain
0   1        0
1   4        1
2   5        0
3   9        1
4  10        1
5  20        0
6  28        0
7  31        0
8  32        0
9  34        0

In [356]:
# dft['netgain'] = df['netgain'].apply(bool)

In [357]:
dft.head()

   id  netgain
0   1        0
1   4        1
2   5        0
3   9        1
4  10        1

In [358]:
dft.netgain.value_counts()

0    5096
1    1417
Name: netgain, dtype: int64

In [359]:
# for x in range(len(dft['netgain'])):
#     if x==0:
#         dft['netgain'][x] = 'false'
#     elif x==1:
#         dft['netgain'][x] = 'true'

In [363]:
dft.loc[dft['netgain']==0,'netgain']='false'
dft.loc[dft['netgain']==1,'netgain']='true'

In [364]:
dft.head()

   id netgain netgain_e
0   1   false     false
1   4    true      true
2   5   false     false
3   9    true      true
4  10    true      true

In [365]:
dft.netgain_e.value_counts()

false    5096
true     1417
Name: netgain_e, dtype: int64

In [366]:
dft.drop(['netgain_e'],axis=1)

         id netgain
0         1   false
1         4    true
2         5   false
3         9    true
4        10    true
...     ...     ...
6508  32538   false
6509  32542   false
6510  32549   false
6511  32558    true
6512  32560   false

[6513 rows x 2 columns]

In [367]:
dft.to_csv("First_submission.csv",index=False)